PBWFormalisation/PBWFormalisation.org
#+title: A Short and Informal Introduction of PBW theorem
#+CREATOR: Notes taken by Dendy Li

#+LATEX_HEADER: \input{~/Preamble/preamble.tex}
#+LATEX_COMPILER: xelatex

# * Tensor Product
# Here's a example of tensor product in low dimension:
# Let \( V:=\R^2 \), the tensor product of \( V \) is just the

* Preliminary
** Topological groups
#+ATTR_LATEX: :options [Topological space]
#+BEGIN_definition
A topological space is a set \(X\) together with a set of subsets \(U \subset X\), called open sets, satisfies the following two operation:
+ finite intersections
+ arbitrary unions
#+END_definition

#+ATTR_LATEX: :options [Topological groups]
#+BEGIN_definition
A topological groups is:
- a group
  + Set \(G\)
  + Identity \(e\in G\)
  + Associative unital function \(f \cdot f\)
  + Inverse function \(f^{-1}\)Two elements's image under associative unital function is the neutral element)
- a topology given on the power set of \(G\), s.t. \(f \cdot f \) and \(f^{-1}\) are continuous functions w.r.t the given topology and the product topology(The latter).
#+END_definition


*Basic ideas of the continuous map: A map is a continuous map if its value do not jump with variation of its argument.*

#+ATTR_LATEX: :options [continuous functions (In topological spaces)]
#+BEGIN_definition
\(f: X \to Y\) is a continuous map(\(X,Y\) are topological spaces) if for every open subset \(U \subseteq Y\), the preimage \(f^{-1}(U)\) is an open subset of \(X\).
#+END_definition

Namely open set maps to open set, where the open sets lie in the given topology.

*Idea of connected: A topological space is connected if it can not be split up into two parts.*

#+ATTR_LATEX: :options [Smooth]
#+BEGIN_definition
We say a function is smooth if it can be differentiate for infinitely many times.
#+END_definition

#+ATTR_LATEX: :options [Closed subgroup]
#+BEGIN_definition
Let \(H,G\) be topological groups, \(H \subseteq G\) is closed if \(H\) is a closed subspace of \(G\) in topological sense.
#+END_definition

*Idea of closed map is just the analog of open map.*

#+ATTR_LATEX: :options [Closed map]
#+BEGIN_definition
A closed map is a map where closed set maps to the closed set.
#+END_definition

*Difference between closed map, open map and continuous map: Closed map and open map talks about where image goes and continuous map talks about where preimage goes.*

* Tensor Product and Tensor
** Informal introduction to Tensor
#+ATTR_LATEX: :options [Index set \(I_n\)]
#+BEGIN_definition
We can define the index set \( I_n := {1,2,\dots,n} \).
#+END_definition

eg. We can use the \( I_n \) we define above to express familiar object in a way that we are not familiat with.

#+ATTR_LATEX: :options [Sequence]
#+BEGIN_definition
A finite sequence \( \{a_k\}_{k = 1}^n \) on \( \R \) is a function:
\[
\{a_k\}_{k = 1}^n : I_n \to \R
\]
where \( \{a_k\}_{k = 1}^n(i) \mapsto a_i \).
#+END_definition

Similarly we can define matrix in a following way:
#+ATTR_LATEX: :options [Matrix]
#+BEGIN_definition
A matrix \( A \in \mathbb{R}^{m\times n} \) is a function:
\[
A : I_m \times I_n \to \R
\]
where \( A(i,j) \mapsto a_{ij} \).
#+END_definition

We can naturally deduce the definition of Tensor from the above convention:

#+ATTR_LATEX: :options [Tensor(Informally)]
#+BEGIN_definition
A Tensor \( T \) is a function:
\[
T : I_{m_1} \times I_{m_2} \times I_{m_k} \to \R (\forall k \in \Z)
\]
where \(T(i_1, i_2, \dots, i_k) \mapsto a_{i_1, i_2, \dots, i_k}\).
#+END_definition

Unfortunately the informal definition of the tensor isn't enough for us to detect enough infomations, one should add more details on the definition.

We first introduce the definition of the tensor product, then we define tensor as the element in the corresponding resulting vector space defined by tensor product.

We can give a formal way to express the idea above
** Tensor as Multidimensional arrays
** Tensor as Multilinear maps
** Categorical definition of Tensor Product
For vector space \(V, W\) the tensor product \(V \otimes W\) is the vector space generated by the elements of form \(v \otimes w\), satisfying the following universal property:
\begin{center}\begin{tikzcd}
V \times W \ar[r,"\phi"] \ar[rd,dashed,swap,"\psi"] & V \otimes W \ar[d,"\varphi"] \\
& \mathcal{T}
\end{tikzcd}\end{center}

Where \(\phi,\psi\) are bilinear maps and \(\varphi\) is linear map.

** Categorical definition of Tensor
** My Personal understanding of Tensor Product
We now stick to the \(\R\)-vector space \( V \) and \( W \), where \( V \) is of dimension \( n \) and \( W \) is of dimension \( m \).

We have the following convention:
- \( B_V \) denote the set of orthonormal bases of \( V \), a typical element in \( B_V \) is \( v_i \) which we represent by \(\begin{bmatrix} 0 \\ \vdots \\ 1_v \\ 0 \\ \vdots \\ 0 \end{bmatrix}\). \( B_W \) denote the set of orthonormal bases of \( W \), a typical element in \( B_W \) is \( w_i \) which we represent by \(\begin{bmatrix} 0 \\ \vdots \\ 1_w \\ 0 \\ \vdots \\ 0 \end{bmatrix}\)

- Here \( 1_v, 1_w \) denote the identity in the vector space \( V, W \) seperately. \( v_i \in \R^{n\times 1}\) and \(w_j \in \R^{m\times 1}\).

By the universal property of Tensor product we have the following diagram commute:
\begin{center}\begin{tikzcd}
V\times W \ar[r,"\phi"] \ar[rd, dashed, swap, "\psi"] & V \otimes W \ar[d,"\varphi"] \\
& \mathcal{T}
\end{tikzcd}\end{center}

Where \(\forall v \in V, \forall w \in W\), we have the following commutative diagram shows where the elements goes:

\begin{center}\begin{tikzcd}
(Span(v),Span(w)) \ar[r, mapsto] \ar[rd, mapsto] & Span(v) \otimes Span(w) \ar[d, mapsto] \\
& T_{v\otimes w}
\end{tikzcd}\end{center}

here \(Span(v), Span(w)\) represents the linear combination of \(v,w\) under the given orthonormal bases with coefficient in \( \R \).
* Lie Groups
*Lie group is a group also a manifold.*
*Basic convention: \(\R\) for real number with addition, \(\R^{\times}\) for non-zero real number with multiplication.

** Dimension 0 Lie groups
same as discrete groups

We can split any lie group into a connected part and a discrete part.

eg. \(R_{>0} \to \R^{\times} \to \{+,-\}\)

** Dimension 1 Lie groups
- \(\R\)
- \(\R^{\times}\)
- \(S^1\)

#+ATTR_LATEX: :options [Local Isomorphism(informal)]
#+BEGIN_definition
Near identity element the two groups are looks the same.
#+END_definition

** Dimension 2 Lie groups
- \(R^1 \times R^1\)
- \(R^1 \times S^1\)
- \(S^1 \times S^1\)
Any abelian connected Lie group \(\simeq R^m \times (S^1)^n\)

*First Non-abelian Lie group*
\(ax + b\) group

This is a solvable lie group.

#+ATTR_LATEX: :options [Solvable group]
#+BEGIN_definition
Group \(G\) is solvable is there is a chain of subgroups, every nearby component's quotient in the chain is abelian.
#+END_definition

** Dimension 3 Lie groups
*Most important Lie group*
- \(SL_2(\R)\)
  *Remark: This is dimension \(3\) because the \(2\times 2\) matrices are dimension \(4\), setting determinant to 1 reduce 1 dimension.*

#+ATTR_LATEX: :options [Nilpotent group]
#+BEGIN_definition
Let \(G_0\) be a group,
\[
G_i = G_{i-1}/center,
\]
if there exists \(n\), such that \(G_n = 1\), then \(G_0\) is called Nilpotent.
#+END_definition

