PBWFormalisation/PBWFormalisation.tex
% Created 2024-11-04 Mon 15:34
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\input{~/Preamble/preamble.tex}
\author{DendyLijunyi}
\date{\today}
\title{A Short and Informal Introduction of PBW theorem}
\hypersetup{
 pdfauthor={DendyLijunyi},
 pdftitle={A Short and Informal Introduction of PBW theorem},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Notes taken by Dendy Li}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Preliminary}
\label{sec:orgc5fd9bf}
\subsection{Topological groups}
\label{sec:orga6b4e1c}
\begin{definition}[Topological space]
A topological space is a set \(X\) together with a set of subsets \(U \subset X\), called open sets, satisfies the following two operation:
\begin{itemize}
\item finite intersections
\item arbitrary unions
\end{itemize}
\end{definition}

\begin{definition}[Topological groups]
A topological groups is:
\begin{itemize}
\item a group
\begin{itemize}
\item Set \(G\)
\item Identity \(e\in G\)
\item Associative unital function \(f \cdot f\)
\item Inverse function \(f^{-1}\)Two elements's image under associative unital function is the neutral element)
\end{itemize}
\item a topology given on the power set of \(G\), s.t. \(f \cdot f\) and \(f^{-1}\) are continuous functions w.r.t the given topology and the product topology(The latter).
\end{itemize}
\end{definition}


\textbf{Basic ideas of the continuous map: A map is a continuous map if its value do not jump with variation of its argument.}

\begin{definition}[continuous functions (In topological spaces)]
\(f: X \to Y\) is a continuous map(\(X,Y\) are topological spaces) if for every open subset \(U \subseteq Y\), the preimage \(f^{-1}(U)\) is an open subset of \(X\).
\end{definition}

Namely open set maps to open set, where the open sets lie in the given topology.

\textbf{Idea of connected: A topological space is connected if it can not be split up into two parts.}

\begin{definition}[Smooth]
We say a function is smooth if it can be differentiate for infinitely many times.
\end{definition}

\begin{definition}[Closed subgroup]
Let \(H,G\) be topological groups, \(H \subseteq G\) is closed if \(H\) is a closed subspace of \(G\) in topological sense.
\end{definition}

\textbf{Idea of closed map is just the analog of open map.}

\begin{definition}[Closed map]
A closed map is a map where closed set maps to the closed set.
\end{definition}

\textbf{Difference between closed map, open map and continuous map: Closed map and open map talks about where image goes and continuous map talks about where preimage goes.}
\section{Tensor Product and Tensor}
\label{sec:org695a90a}
\subsection{Informal introduction to Tensor}
\label{sec:org9436e0d}
\begin{definition}[Index set \(I_n\)]
We can define the index set \(I_n := {1,2,\dots,n}\).
\end{definition}

eg. We can use the \(I_n\) we define above to express familiar object in a way that we are not familiat with.

\begin{definition}[Sequence]
A finite sequence \(\{a_k\}_{k = 1}^n\) on \(\R\) is a function:
\[
\{a_k\}_{k = 1}^n : I_n \to \R
\]
where \(\{a_k\}_{k = 1}^n(i) \mapsto a_i\).
\end{definition}

Similarly we can define matrix in a following way:
\begin{definition}[Matrix]
A matrix \(A \in \mathbb{R}^{m\times n}\) is a function:
\[
A : I_m \times I_n \to \R
\]
where \(A(i,j) \mapsto a_{ij}\).
\end{definition}

We can naturally deduce the definition of Tensor from the above convention:

\begin{definition}[Tensor(Informally)]
A Tensor \(T\) is a function:
\[
T : I_{m_1} \times I_{m_2} \times I_{m_k} \to \R (\forall k \in \Z)
\]
where \(T(i_1, i_2, \dots, i_k) \mapsto a_{i_1, i_2, \dots, i_k}\).
\end{definition}

Unfortunately the informal definition of the tensor isn't enough for us to detect enough infomations, one should add more details on the definition.

We first introduce the definition of the tensor product, then we define tensor as the element in the corresponding resulting vector space defined by tensor product.

We can give a formal way to express the idea above
\subsection{Tensor as Multidimensional arrays}
\label{sec:org447c717}
\subsection{Tensor as Multilinear maps}
\label{sec:orgfdaf60d}
\subsection{Categorical definition of Tensor Product}
\label{sec:orgfc8b6aa}
For vector space \(V, W\) the tensor product \(V \otimes W\) is the vector space generated by the elements of form \(v \otimes w\), satisfying the following universal property:
\begin{center}\begin{tikzcd}
V \times W \ar[r,"\phi"] \ar[rd,dashed,swap,"\psi"] & V \otimes W \ar[d,"\varphi"] \\
& \mathcal{T}
\end{tikzcd}\end{center}

Where \(\phi,\psi\) are bilinear maps and \(\varphi\) is linear map.
\subsection{Categorical definition of Tensor}
\label{sec:orge69256a}
\subsection{My Personal understanding of Tensor Product}
\label{sec:org47e2abf}
We now stick to the \(\R\)-vector space \(V\) and \(W\), where \(V\) is of dimension \(n\) and \(W\) is of dimension \(m\).

We have the following convention:
\begin{itemize}
\item \(B_V\) denote the set of orthonormal bases of \(V\), a typical element in \(B_V\) is \(v_i\) which we represent by \(\begin{bmatrix} 0 \\ \vdots \\ 1_v \\ 0 \\ \vdots \\ 0 \end{bmatrix}\). \(B_W\) denote the set of orthonormal bases of \(W\), a typical element in \(B_W\) is \(w_i\) which we represent by \(\begin{bmatrix} 0 \\ \vdots \\ 1_w \\ 0 \\ \vdots \\ 0 \end{bmatrix}\)

\item Here \(1_v, 1_w\) denote the identity in the vector space \(V, W\) seperately. \(v_i \in \R^{n\times 1}\) and \(w_j \in \R^{m\times 1}\).
\end{itemize}

By the universal property of Tensor product we have the following diagram commute:
\begin{center}\begin{tikzcd}
V\times W \ar[r,"\phi"] \ar[rd, dashed, swap, "\psi"] & V \otimes W \ar[d,"\varphi"] \\
& \mathcal{T}
\end{tikzcd}\end{center}

Where \(\forall v \in V, \forall w \in W\), we have the following commutative diagram shows where the elements goes:

\begin{center}\begin{tikzcd}
(Span(v),Span(w)) \ar[r, mapsto] \ar[rd, mapsto] & Span(v) \otimes Span(w) \ar[d, mapsto] \\
& T_{v\otimes w}
\end{tikzcd}\end{center}

here \(Span(v), Span(w)\) represents the linear combination of \(v,w\) under the given orthonormal bases with coefficient in \(\R\).
\section{Lie Groups}
\label{sec:org0b109f1}
\textbf{Lie group is a group also a manifold.}
*Basic convention: \(\R\) for real number with addition, \(\R^{\times}\) for non-zero real number with multiplication.
\subsection{Dimension 0 Lie groups}
\label{sec:org02987a9}
same as discrete groups

We can split any lie group into a connected part and a discrete part.

eg. \(R_{>0} \to \R^{\times} \to \{+,-\}\)
\subsection{Dimension 1 Lie groups}
\label{sec:org2f3bad0}
\begin{itemize}
\item \(\R\)
\item \(\R^{\times}\)
\item \(S^1\)
\end{itemize}

\begin{definition}[Local Isomorphism(informal)]
Near identity element the two groups are looks the same.
\end{definition}
\subsection{Dimension 2 Lie groups}
\label{sec:org8310860}
\begin{itemize}
\item \(R^1 \times R^1\)
\item \(R^1 \times S^1\)
\item \(S^1 \times S^1\)
\end{itemize}
Any abelian connected Lie group \(\simeq R^m \times (S^1)^n\)

\textbf{First Non-abelian Lie group}
\(ax + b\) group

This is a solvable lie group.

\begin{definition}[Solvable group]
Group \(G\) is solvable is there is a chain of subgroups, every nearby component's quotient in the chain is abelian.
\end{definition}
\subsection{Dimension 3 Lie groups}
\label{sec:org4d4383d}
\textbf{Most important Lie group}
\begin{itemize}
\item \(SL_2(\R)\)
\textbf{Remark: This is dimension \(3\) because the \(2\times 2\) matrices are dimension \(4\), setting determinant to 1 reduce 1 dimension.}
\end{itemize}

\begin{definition}[Nilpotent group]
Let \(G_0\) be a group,
\[
G_i = G_{i-1}/center,
\]
if there exists \(n\), such that \(G_n = 1\), then \(G_0\) is called Nilpotent.
\end{definition}
