PBWFormalisation/PBWFormalisation.org
** Connected & Closed
#+ATTR_LATEX: :options [Connected]
#+BEGIN_definition
We say a Lie group is connected if the Group's multiplication map and the inverse map are all smooth maps.
#+END_definition

#+ATTR_LATEX: :options [Closed]
#+BEGIN_definition
We
#+END_definition
* Lie Algebra
*Motivation: Lie groups is very complicated, so we use lie algebra to decribe lie group near the identity.*

Recall of manifold.

#+ATTR_LATEX: :options [\(1^{st}\) order differential operators]
#+BEGIN_definition
\(\Sigma f_i (x_1,\dots,x_n) \)
#+END_definition

#+ATTR_LATEX: :options [Vector fields]
#+BEGIN_definition
Geometric way to see \(1^{st}\) order differential operators.
#+END_definition

#+ATTR_LATEX: :options [Infinitesimal automorphisms]
#+BEGIN_definition
Vector field like an automorphism to move everything in a infinitly samll distence.
#+END_definition

** Define Lie Bracket
*Goal: How to put an algebraic structure on the \(1^{st}\) order differential operators?*

Consider the following process:
- Let \(D = \Sigma f_i, \ E = \Sigma g_i\)
- \(DE = \Sigma f_i \Sigma g_j\) by chain rule
- \(ED = \Sigma f_i \Sigma g_j\) by chain rule
- *Observe that \(DE\) and \(ED\) almost commute, and \(DE - ED\) is again a \(1^st\) order operator, this leads to the definition of lie bracket.*
- Define lie bracket of \([D,E] = DE - ED\).

  *Next we consider what identity satisfies by \([D,E]\)?(not to find the identity element)*

  - \([D,E] = -[E,D]\)
  - Jacobi Identity
  -

*Check of Jacobi Identity:*
#+ATTR_LATEX: :options [Check of Jacobi Identity]
#+BEGIN_proof
\leavevmode

wts: \([[A,B],C] + [[B,C],A] + [[C,A],B] = 0 \)

\begin{align}
[[A,B],C] + [[B,C],A] + [[C,A],B]
&= [AB - BA, C] + [BC - CB, A] + [CA - AC, B] \\
&= (AB - BA)C - C(AB - BA) + (BC - CB)A - A(BC - CB) \nonumber \\
&\quad + (CA - AC)B - B(CA - AC) \\
&= ABC - BAC - CAB + CBA + BCA - CBA \nonumber \\
&\quad - ABC + ACB + CAB - ACB - BCA + BAC \\
&= 0
\end{align}

#+END_proof


#+ATTR_LATEX: :options [Lie Algebra]
#+BEGIN_definition
A Lie Algebra \(L\) is a vector space over a field \(F\) with an additional operation(Lie Bracket) \(L \times L \to L\). This operation satisfies the following properties
+ Bilinear
+ \([xx]\) = 0 for all \(x\) in \(L\)
+ \([x[yz]] + [y[zx]] + [z[xy]] =  0\) for all \(x,y,z \in L\)
#+END_definition

** Find the lie algebra of a lie group
*** Abstract Way
Look at the vector field on \(G\), to be concrete *Left-invariant vector field*.

Why left-invariant vector field?
Left-invariant vector field is uniquely determined by the identity. In this case corresponds to the tangent vectors at identity.

We consider \(G\) acts on \(G\) by left translation.

By definition left-invariant vector fields closed under lie-bracket.

How to do it?
Take a tangent vector at the identity, make it to a left-invariant vector fields, calculate the lie bracket of them and restrict back to the identity.

*** Compute some trivial case
Let \(G = \R^n\) under addition,
- Left invariant vector fields: \(\Sigma a_i\).
- \([,] = 0\).

Let \(G = GL_n(\R)\),
- Lie algebra corresponding to \(M_n(\R)\)

How a matrix in \(M_n(\R)\) corresponds to a vector field and why the lie bracket operation matches?

Lie bracket and the commutator of the group

Hall-Witt identity and Jacobi Identity

* Tensor Algebra and Symmetric Algebra
** Tensor Algebra
#+ATTR_LATEX: :options [Tensor Algebra]
#+BEGIN_definition
Informally, tensor algebra can be viewed as a direct sum of vecter spaces which is also a vector space.
#+END_definition

Next we show how to construct a Tensor Algebra \(T(V)\) out of a vector space \(V\).

#+ATTR_LATEX: :options [Tensor Algebra of degree \(i\)]
#+BEGIN_definition
We denote Tensor Algebra of degree \(i\) on vector space \(V\) over field \(F\) as \(T^iV\), which is the tensor product of \(V\) takes \(i\) times, namely
\[
T^iV := \bigotimes\limits_{k = 1}^iV
\]
we define \(T^0V = F\).
#+END_definition

Using the above notation we can define the Tensor Algebra \(T(V) = \bigoplus\limits_{i = 0}^{\infty} T^iV\).

Next we construct the symmetric algebra out of the tensor algebra(\(T(V)\)) on vector space \(V\) of the field \(F\).

** Symmetric Algebra
#+ATTR_LATEX: :options ["Force Commutative" ideal \(\mathfrak{b}\)]
#+BEGIN_definition
In \(T^iV\), we define \(\mathfrak{b}_i\) be the ideal generated by all the element of form
\[
x_1 \otimes \cdots \otimes x_i - x_{\sigma(1)} \otimes \cdots \otimes x_{\sigma(i)}
\]
here \(\sigma\) is any permutation on \({1,2,\dots,i}\).
#+END_definition

#+ATTR_LATEX: :options [Symmetric Algebra of degree \(i\)]
#+BEGIN_definition
We define symmetric algebra of degree \(i\) as follows
\[
S^iV = T^iV / \mathfrak{b}_i
\]
#+END_definition

By analog we define the Symmetric Algebra on vector space \(V\) as follows
#+ATTR_LATEX: :options [Symmetric Algebra on vector space \(V\)]
#+BEGIN_definition
We denote symmetric algebra on vector space \(V\) on field \(F\) as \(S(V)\), which is defined as follows
\[
S(V) := \bigoplus\limits_{i = 0}^{\infty} S^iV
\]
#+END_definition

* Universal Enveloping Algebra and PBW theorem
** Universal Enveloping Algebra
Since Lie Algebra\(L\) is a vector space so we can natural construct the tensor algebra\((T(L)\)and the symmetric algebra \(S(L)\).

The goal of the PBW theorem is to show the isomorphism between \(S(L)\) and an "Universal enveloping algebra \(U(L)\)" which connect with the Lie Algebra \(L\) by a canonical map induced by the bracket operation in the Lie Algebra(i.e. \(L\) can be embedding in \(U(L)\) by a canonical map \(i\), where \(i\) is a linear map satisfies \(i([xy]) = i(x)i(y) - i(y)i(x)\)).

Now we construct the Universal enveploping algebra \(U(L)\) on the Lie Algebra \(L\) over the field \(F\), where
\[
U(L):= T(L)/\sim
\]
here ~ represents the relation \(x \sim y\) if \(x,y\) satisfies \(i([xy]) = i(x)i(y) - i(y)i(x)\), one can also think of ~ as the ideal generated by the element \(x \otimes y - y \otimes x - [xy]\).

This construction above shows the existence of \(U(L)\). \(U(L)\) also has the universal property to insure the uniqueness of \((U(L),i)\), i.e. if we have another pair \((U^{\prime},i^{\prime})\) then there is an isomorphism between the two pairs.

** PBW theorem
Once we have the PBW theorem, we have \(L \to U(L) \simeq S(L)\). This shows the idea in the front of the chapter where we can associate the Lie algebra \(L\) to an associative algebra(i.e.\(U(L)\)) which is generated as "freely" as possible by the commutation relations(relation ~ above).

** Proof of PBW theorem
*Goal: \(U(L)\) is the same size of the polynomial algebra on \(n\) variables where \(n = dim(L)\).*

