PBWFormalisation/PBWFormalisation.tex
\subsection{Connected \& Closed}
\label{sec:orgd684295}
\begin{definition}[Connected]
We say a Lie group is connected if the Group's multiplication map and the inverse map are all smooth maps.
\end{definition}

\begin{definition}[Closed]
We
\end{definition}
\section{Lie Algebra}
\label{sec:orgeda8446}
\textbf{Motivation: Lie groups is very complicated, so we use lie algebra to decribe lie group near the identity.}

Recall of manifold.

\begin{definition}[\(1^{st}\) order differential operators]
\(\Sigma f_i (x_1,\dots,x_n)\)
\end{definition}

\begin{definition}[Vector fields]
Geometric way to see \(1^{st}\) order differential operators.
\end{definition}

\begin{definition}[Infinitesimal automorphisms]
Vector field like an automorphism to move everything in a infinitly samll distence.
\end{definition}
\subsection{Define Lie Bracket}
\label{sec:org690230b}
\textbf{Goal: How to put an algebraic structure on the \(1^{st}\) order differential operators?}

Consider the following process:
\begin{itemize}
\item Let \(D = \Sigma f_i, \ E = \Sigma g_i\)
\item \(DE = \Sigma f_i \Sigma g_j\) by chain rule
\item \(ED = \Sigma f_i \Sigma g_j\) by chain rule
\item \textbf{Observe that \(DE\) and \(ED\) almost commute, and \(DE - ED\) is again a \(1^st\) order operator, this leads to the definition of lie bracket.}
\item Define lie bracket of \([D,E] = DE - ED\).

\textbf{Next we consider what identity satisfies by \([D,E]\)?(not to find the identity element)}

\begin{itemize}
\item \([D,E] = -[E,D]\)
\item Jacobi Identity
\item 
\end{itemize}
\end{itemize}

\textbf{Check of Jacobi Identity:}
\begin{proof}[Check of Jacobi Identity]
\leavevmode

wts: \([[A,B],C] + [[B,C],A] + [[C,A],B] = 0\)

\begin{align}
[[A,B],C] + [[B,C],A] + [[C,A],B]
&= [AB - BA, C] + [BC - CB, A] + [CA - AC, B] \\
&= (AB - BA)C - C(AB - BA) + (BC - CB)A - A(BC - CB) \nonumber \\
&\quad + (CA - AC)B - B(CA - AC) \\
&= ABC - BAC - CAB + CBA + BCA - CBA \nonumber \\
&\quad - ABC + ACB + CAB - ACB - BCA + BAC \\
&= 0
\end{align}
\end{proof}


\begin{definition}[Lie Algebra]
A Lie Algebra \(L\) is a vector space over a field \(F\) with an additional operation(Lie Bracket) \(L \times L \to L\). This operation satisfies the following properties
\begin{itemize}
\item Bilinear
\item \([xx]\) = 0 for all \(x\) in \(L\)
\item \([x[yz]] + [y[zx]] + [z[xy]] =  0\) for all \(x,y,z \in L\)
\end{itemize}
\end{definition}
\subsection{Find the lie algebra of a lie group}
\label{sec:orgabb898e}
\subsubsection{Abstract Way}
\label{sec:org933da86}
Look at the vector field on \(G\), to be concrete \textbf{Left-invariant vector field}.

Why left-invariant vector field?
Left-invariant vector field is uniquely determined by the identity. In this case corresponds to the tangent vectors at identity.

We consider \(G\) acts on \(G\) by left translation.

By definition left-invariant vector fields closed under lie-bracket.

How to do it?
Take a tangent vector at the identity, make it to a left-invariant vector fields, calculate the lie bracket of them and restrict back to the identity.
\subsubsection{Compute some trivial case}
\label{sec:orgac0d2c9}
Let \(G = \R^n\) under addition,
\begin{itemize}
\item Left invariant vector fields: \(\Sigma a_i\).
\item \([,] = 0\).
\end{itemize}

Let \(G = GL_n(\R)\),
\begin{itemize}
\item Lie algebra corresponding to \(M_n(\R)\)
\end{itemize}

How a matrix in \(M_n(\R)\) corresponds to a vector field and why the lie bracket operation matches?

Lie bracket and the commutator of the group

Hall-Witt identity and Jacobi Identity
\section{Tensor Algebra and Symmetric Algebra}
\label{sec:org0c25354}
\subsection{Tensor Algebra}
\label{sec:org08638d5}
\begin{definition}[Tensor Algebra]
Informally, tensor algebra can be viewed as a direct sum of vecter spaces which is also a vector space.
\end{definition}

Next we show how to construct a Tensor Algebra \(T(V)\) out of a vector space \(V\).

\begin{definition}[Tensor Algebra of degree \(i\)]
We denote Tensor Algebra of degree \(i\) on vector space \(V\) over field \(F\) as \(T^iV\), which is the tensor product of \(V\) takes \(i\) times, namely
\[
T^iV := \bigotimes\limits_{k = 1}^iV
\]
we define \(T^0V = F\).
\end{definition}

Using the above notation we can define the Tensor Algebra \(T(V) = \bigoplus\limits_{i = 0}^{\infty} T^iV\).

Next we construct the symmetric algebra out of the tensor algebra(\(T(V)\)) on vector space \(V\) of the field \(F\).
\subsection{Symmetric Algebra}
\label{sec:org2b7caf5}
\begin{definition}["Force Commutative" ideal \(\mathfrak{b}\)]
In \(T^iV\), we define \(\mathfrak{b}_i\) be the ideal generated by all the element of form
\[
x_1 \otimes \cdots \otimes x_i - x_{\sigma(1)} \otimes \cdots \otimes x_{\sigma(i)}
\]
here \(\sigma\) is any permutation on \({1,2,\dots,i}\).
\end{definition}

\begin{definition}[Symmetric Algebra of degree \(i\)]
We define symmetric algebra of degree \(i\) as follows
\[
S^iV = T^iV / \mathfrak{b}_i
\]
\end{definition}

By analog we define the Symmetric Algebra on vector space \(V\) as follows
\begin{definition}[Symmetric Algebra on vector space \(V\)]
We denote symmetric algebra on vector space \(V\) on field \(F\) as \(S(V)\), which is defined as follows
\[
S(V) := \bigoplus\limits_{i = 0}^{\infty} S^iV
\]
\end{definition}
\section{Universal Enveloping Algebra and PBW theorem}
\label{sec:org6d719ff}
\subsection{Universal Enveloping Algebra}
\label{sec:org06a9fbd}
Since Lie Algebra\(L\) is a vector space so we can natural construct the tensor algebra\((T(L)\)and the symmetric algebra \(S(L)\).

The goal of the PBW theorem is to show the isomorphism between \(S(L)\) and an ``Universal enveloping algebra \(U(L)\)'' which connect with the Lie Algebra \(L\) by a canonical map induced by the bracket operation in the Lie Algebra(i.e. \(L\) can be embedding in \(U(L)\) by a canonical map \(i\), where \(i\) is a linear map satisfies \(i([xy]) = i(x)i(y) - i(y)i(x)\)).

Now we construct the Universal enveploping algebra \(U(L)\) on the Lie Algebra \(L\) over the field \(F\), where
\[
U(L):= T(L)/\sim
\]
here \textasciitilde{} represents the relation \(x \sim y\) if \(x,y\) satisfies \(i([xy]) = i(x)i(y) - i(y)i(x)\), one can also think of \textasciitilde{} as the ideal generated by the element \(x \otimes y - y \otimes x - [xy]\).

This construction above shows the existence of \(U(L)\). \(U(L)\) also has the universal property to insure the uniqueness of \((U(L),i)\), i.e. if we have another pair \((U^{\prime},i^{\prime})\) then there is an isomorphism between the two pairs.
\subsection{PBW theorem}
\label{sec:orgdef6f5c}
Once we have the PBW theorem, we have \(L \to U(L) \simeq S(L)\). This shows the idea in the front of the chapter where we can associate the Lie algebra \(L\) to an associative algebra(i.e.\(U(L)\)) which is generated as ``freely'' as possible by the commutation relations(relation \textasciitilde{} above).
\subsection{Proof of PBW theorem}
\label{sec:org01c5105}
\textbf{Goal: \(U(L)\) is the same size of the polynomial algebra on \(n\) variables where \(n = dim(L)\).}
