PBWFormalisation/PBWFormalisation.org
*** Part I-Find the "upper bound" of the universal enveloping algebra (Symmetric Algebra \(\to\) Universal enveloping Algebra is onto)

#+ATTR_LATEX: :options [Universal enveloping algebra characterisation]
#+BEGIN_definition
We denote the universal enveloping algebra generated by lie algebra \(L\) by \(U(L)\). This is an associative algebra generated by \(L\), with the following correspondence:
- \(L \to U(L)\)
- \(a \to a\)
- \(b \to b\)
- \([a,b] \to ab - ba\)
#+END_definition

We go through some example to get familiar with the concept.
eg:
- Let \(L\) abelian, \([a,b] = 0\), with basis \(a_1,\dots,a_n\), then \(U(L)\) in this case is just \(\R[a_1,\dots,a_n]\).
- Let \(L\) spanned by \(a,b, [a,b] = b\), then \(U(L)\) generated by \(a,b\) with \(ab - ba = b\).


*For Lie algebra \(L\), pick its basis \(a_1, a_2, \dots, a_n\), then by the convention before \(U(L)\) is spanned by \(a_{i_1}, a_{i_2}, \dots, a_{i_k}\).*

More information should be added to show why we can arrange \(a_{i_1}, a_{i_2}, \dots, a_{i_k}\) in an increasing order.

*** Part II-Find the lower bound of the universal enveloping algebra.
