PBWFormalisation/PBWFormalisation.tex
\subsubsection{Part I-Find the ``upper bound'' of the universal enveloping algebra (Symmetric Algebra \(\to\) Universal enveloping Algebra is onto)}
\label{sec:org8784baf}

\begin{definition}[Universal enveloping algebra characterisation]
We denote the universal enveloping algebra generated by lie algebra \(L\) by \(U(L)\). This is an associative algebra generated by \(L\), with the following correspondence:
\begin{itemize}
\item \(L \to U(L)\)
\item \(a \to a\)
\item \(b \to b\)
\item \([a,b] \to ab - ba\)
\end{itemize}
\end{definition}

We go through some example to get familiar with the concept.
eg:
\begin{itemize}
\item Let \(L\) abelian, \([a,b] = 0\), with basis \(a_1,\dots,a_n\), then \(U(L)\) in this case is just \(\R[a_1,\dots,a_n]\).
\item Let \(L\) spanned by \(a,b, [a,b] = b\), then \(U(L)\) generated by \(a,b\) with \(ab - ba = b\).
\end{itemize}


\textbf{For Lie algebra \(L\), pick its basis \(a_1, a_2, \dots, a_n\), then by the convention before \(U(L)\) is spanned by \(a_{i_1}, a_{i_2}, \dots, a_{i_k}\).}

More information should be added to show why we can arrange \(a_{i_1}, a_{i_2}, \dots, a_{i_k}\) in an increasing order.
\subsubsection{Part II-Find the lower bound of the universal enveloping algebra.}
\label{sec:org52643ab}
\end{document}
